app/controllers/group_orders_controller.rb

def index
  tasks = params[:task]
  group_orders = Group.find(params[:group_id]).orders
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
SELECT `orders`.* FROM `orders` WHERE `orders`.`group_id` = 1