app/controllers/groups_controller.rb

  def index
    @groups = $user.groups
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`user_id` = 1

  def show
    @group = Group.find(params[:id])
    $group = @group
    @tasks = []
    @group.orders.each do |f|
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
SELECT `orders`.* FROM `orders` WHERE `orders`.`group_id` = 1

  def create
    @group = Group.new(params[:group])
    @group.user = $user

    respond_to do |format|
      if @group.save
---
INSERT INTO `groups` (`created_at`, `name`, `updated_at`, `user_id`) VALUES ('2013-01-12 21:29:58', 'test', '2013-01-12 21:29:58', 1)