app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
    @group = Group.find(params[:group_id])
---
SELECT `tasks`.* FROM `tasks`
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1

  def new
    @task = Task.new
    @group = Group.find(params[:group_id])
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1

  def create
    @task = Task.new(params[:task])
    @task.group = Group.find(params[:group_id])


    respond_to do |format|
      if @task.save
        Order.new(:group_id => @task.group.id, :task_id => @task.id).save
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
INSERT INTO `tasks` (`created_at`, `description`, `group_id`, `title`, `updated_at`) VALUES ('2013-01-12 21:36:09', 'teste', 1, 'test', '2013-01-12 21:36:09')
INSERT INTO `orders` (`created_at`, `group_id`, `task_id`, `updated_at`) VALUES ('2013-01-12 22:19:41', 1, NULL, '2013-01-12 22:19:41')

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 2 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 2