app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `first_name`, `last_name`, `updated_at`) VALUES ('2013-01-12 20:32:50', 'test', 'test', '2013-01-12 20:32:50')